# DataFrame_Basic
-----------------------
A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components the data, rows, and columns.

In [45]:
student={'Name':['Amandeep','Srajan','Aman','Vibhor'],
          'Age':[20,21,19,20],
          'City':['Lucknow','Kanpur','Jhansi','Dehradun'],
          'email':['amandeep@gmail.com','jaiswalsrajan@gmail.com','aman@gmail.com','vibhu@gmail.com']
        }

In [46]:
student

{'Name': ['Amandeep', 'Srajan', 'Aman', 'Vibhor'],
 'Age': [20, 21, 19, 20],
 'City': ['Lucknow', 'Kanpur', 'Jhansi', 'Dehradun'],
 'email': ['amandeep@gmail.com',
  'jaiswalsrajan@gmail.com',
  'aman@gmail.com',
  'vibhu@gmail.com']}

In [47]:
import pandas as pd
df=pd.DataFrame(student)       #creation  of DataFrame using dictionary

In [48]:
df

       Name  Age      City                    email
0  Amandeep   20   Lucknow       amandeep@gmail.com
1    Srajan   21    Kanpur  jaiswalsrajan@gmail.com
2      Aman   19    Jhansi           aman@gmail.com
3    Vibhor   20  Dehradun          vibhu@gmail.com

In [49]:
df['email']            #retrieving columns by indexing operator

0         amandeep@gmail.com
1    jaiswalsrajan@gmail.com
2             aman@gmail.com
3            vibhu@gmail.com
Name: email, dtype: object

In [11]:
df.email

0         amandeep@gmail.com
1    jaiswalsrajan@gmail.com
2             aman@gmail.com
3            vibhu@gmail.com
Name: email, dtype: object

In [12]:
type(df['email'])           #datatype

pandas.core.series.Series

In [13]:
df.columns             #names of columns

Index(['Name', 'Age', 'City', 'email'], dtype='object')

In [14]:
df.shape               #dimension

(4, 4)

In [16]:
df.info()                     #no of rows,columns,dtype

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
 3   email   4 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

In [17]:
df.head()

       Name  Age      City                    email
0  Amandeep   20   Lucknow       amandeep@gmail.com
1    Srajan   21    Kanpur  jaiswalsrajan@gmail.com
2      Aman   19    Jhansi           aman@gmail.com
3    Vibhor   20  Dehradun          vibhu@gmail.com

In [18]:
df.head(2)            #first two entries in table

       Name  Age     City                    email
0  Amandeep   20  Lucknow       amandeep@gmail.com
1    Srajan   21   Kanpur  jaiswalsrajan@gmail.com

In [21]:
df.tail()

       Name  Age      City                    email
0  Amandeep   20   Lucknow       amandeep@gmail.com
1    Srajan   21    Kanpur  jaiswalsrajan@gmail.com
2      Aman   19    Jhansi           aman@gmail.com
3    Vibhor   20  Dehradun          vibhu@gmail.com

In [22]:
df.tail(1)

     Name  Age      City            email
3  Vibhor   20  Dehradun  vibhu@gmail.com

In [23]:
df.iloc[0]                #gives ous row using indexing

Name               Amandeep
Age                      20
City                Lucknow
email    amandeep@gmail.com
Name: 0, dtype: object

In [24]:
df.iloc[[0,1]]

       Name  Age     City                    email
0  Amandeep   20  Lucknow       amandeep@gmail.com
1    Srajan   21   Kanpur  jaiswalsrajan@gmail.com

In [27]:
df.iloc[[0,1],2]

0    Lucknow
1     Kanpur
Name: City, dtype: object

In [30]:
df.loc[0:3,'email']               #also gives ous rows and label can be passed

0         amandeep@gmail.com
1    jaiswalsrajan@gmail.com
2             aman@gmail.com
3            vibhu@gmail.com
Name: email, dtype: object

In [31]:
df.loc[::-1]                        #gives entries in reverse order

       Name  Age      City                    email
3    Vibhor   20  Dehradun          vibhu@gmail.com
2      Aman   19    Jhansi           aman@gmail.com
1    Srajan   21    Kanpur  jaiswalsrajan@gmail.com
0  Amandeep   20   Lucknow       amandeep@gmail.com

In [34]:
df.loc[[0,1],['City','email']]

      City                    email
0  Lucknow       amandeep@gmail.com
1   Kanpur  jaiswalsrajan@gmail.com

In [36]:
del df['email']                   #delete column from DataFrame

In [37]:
df

       Name  Age      City
0  Amandeep   20   Lucknow
1    Srajan   21    Kanpur
2      Aman   19    Jhansi
3    Vibhor   20  Dehradun

In [42]:
df.pop('Age')            #remove columns from DataFrame

0    20
1    21
2    19
3    20
Name: Age, dtype: int64

In [43]:
df

       Name      City
0  Amandeep   Lucknow
1    Srajan    Kanpur
2      Aman    Jhansi
3    Vibhor  Dehradun